# SetLayerFunction Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
CompoundStructure..::..SetLayerFunction Method
CompoundStructure Class See Also
---
Sets the function of the specified layer.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public void SetLayerFunction(
	int layerIdx,
	MaterialFunctionAssignment function
)
```

Visual Basic
---
```text
Public Sub SetLayerFunction ( _
	layerIdx As Integer, _
	function As MaterialFunctionAssignment _
)
```

Visual C++
---
```text
public:
void SetLayerFunction(
	int layerIdx,
	MaterialFunctionAssignment function
)
```

# ### Parameters
layerIdx
    Type: System..::..Int32 Index of a layer in the CompoundStructure.
function
    Type: Autodesk.Revit.DB..::..MaterialFunctionAssignment The function of the layer.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | The layer index is out of range. -or- A value passed for an enumeration argument is not a member of that enumeration |

# See Also
CompoundStructure Class
Autodesk.Revit.DB Namespace